package org.example.service;

public interface CharArrayReplacer {
    /**
     * Функція яка проводить заміни підрядків в рядку
     * Функція на вхід приймає 3 char масиви
     * 1-й - оригінальний рядок в якому шукаємо
     * 2-й - рядок який шукаємо в оригінальному
     * 3-й - рядок на який замінюємо знайдений рядок
     * На виході функція повертає char масив з виконаними замінами
     * Довжина параметру 2 і 3 можуть не співпадати
     * Кількість входжень параметру 2 в периметр 1 від 0 до …
     * Приклад
     * На вході
     * {‘1’, ‘2’, ‘3’, ‘4’, ‘5’}
     * {‘1’,’ 2’}
     * {‘a’, ‘b’, ‘c’}
     * На виході
     * {‘a’, ‘b’, ‘c’, ‘3’, ‘4’, ‘5’}
     * Не використовувати вбудовані класи тільки if for new
     * Не використовувати LLM
     */
    char[] replaceChars(char[] originalArray, char[] searchArray, char[] replacementArray);
}
